# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\kit\Documents\PSoC Creator\Design03\SerialTest.cydsn\SerialTest.cyprj
# Date: Fri, 05 Jun 2015 01:12:00 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 541.66666666666663 -waveform {0 270.833333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 13 27} -nominal_period 541.66666666666663 [list]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for C:\Users\kit\Documents\PSoC Creator\Design03\SerialTest.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\kit\Documents\PSoC Creator\Design03\SerialTest.cydsn\SerialTest.cyprj
# Date: Fri, 05 Jun 2015 01:11:48 GMT
